NextFOAM-2407/tutorials/compressible/rhoPimpleAdiabaticFoam/rutlandVortex2D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

canCompile || exit 0    # Dynamic code

restore0Dir

runApplication blockMesh

runApplication -s preProcess \
    $(getApplication) -postProcess -dict system/preProcess

runApplication decomposePar

runParallel $(getApplication)

#------------------------------------------------------------------------------
